{
    "projects":[
        {
            "eyebrow": "Wayfinder Web App",
            "heading": "Helping people save for their future",
            "thumbnail": "wayfinder_thumb2.png",
            "link": "/wayfinder/",
            "role1": "UX/UI Design",
            "role2": "Interaction Design"
        },
        {
            "eyebrow": "The Canadian Innovation Awards",
            "heading": "Celebrating Canadian Tech Innovation",
            "thumbnail": "cia_thumb2.png",
            "link": "/innovationawards/",
            "role1": "Design Lead",
            "role2": "Motion Design",
            "role3": "Front-End Dev"
        },
        {
            "eyebrow": "Various Motion Projects",
            "heading": "Communicating ideas through motion",
            "thumbnail": "motion_thumb2.png",
            "link": "/motion/",
            "role1": "Design Lead",
            "role2": "Motion Design"
        }
    ],
    "awardscontent": [
        {
            "hero__eyebrow": "Celebrating Canadian tech innovation",
            "hero__title": "The Canadian Innovation Awards",
            "hero__role1": "Design Lead",
            "hero__role2": "Motion Design",
            "hero__role3": "Front-End Dev",
            "hero__client": "Techvibes",
            "hero__thumbnail": "cia_thumb.png",
            "hero__image": "cia/cia_photo1.png",
            "highlights__icon1": "star.svg",
            "highlights__heading1": "New year, new venue, new look",
            "highlights__paragraph1": "After 8 years, the Canadian Startup Awards were renamed to the Canadian Innovation Awards. Having upgraded the venue to the Royal Ontario Museum, the awards needed a more sophisticated look that mirrored the unique event space. ",
            "highlights__icon2": "laughing.svg",
            "highlights__heading2": "MoGraphs that get you movin’",
            "highlights__paragraph2": "On top of putting together a complete awards show package, the team created contextual environmental graphics that sparked conversation and coded reactive motion graphics that moved to the sound of the live band. ",
            "highlights__icon3": "cup.svg",
            "highlights__heading3": "The biggest winner of the night",
            "highlights__paragraph3": "Not only were the rebrand and relaunch a big win for the Techvibes brand but the awards also drew in generous sponsorships and sold out all entry tickets. The support from the Canadian tech community was amazing!",
            "section1__heading1": "01 – Humble beginnings",
            "section1__paragraph1": "In 2010, Techvibes started the Canadian Startup Awards as a community-nominated and community-voted award program to celebrate the emerging tech innovation taking place across the country. Always with the intention of bringing the flourishing Canadian tech community together, the previously online awards were hosted in the real world for the first time at the Steam Whistle Brewery in 2017. The IRL (In Real Life) awards ceremony and after-party was a huge success, but this was only the beginning...",
            "section1__image1": "cia/cia_photo3.png",
            "section1__image1alt": "Toronto's mayor John Tory on stage and speaking at a podium",
            "section1__caption1": "Toronto's mayor John Tory addressed the awards show attendees",
            "section2__pullquote1": "I am excited that we have a spirit of collaboration between governments, universities, accelerator hubs and startups",
            "section2__name1": "Toronto's mayor, John Tory",
            "section3__heading2": "02 – Bigger, better, even more badass",
            "section3__paragraph2": "In 2018, the venue was upgraded to the Royal Ontario Museum and the awards needed a new look to match. Acutely aware of the geometric event space, I proposed a visual language that incorporated 3D models with a wireframe shader. The wireframe geometry mirrored the sharp angles of the crystal’s interior while the shallow depth of field and unhinged camera added a sense of exploration and mystery.",
            "section3__embed1" : "https://player.vimeo.com/video/341269351",
            "section3__caption1" : "A wireframed model animation was designed for each corresponding award providing a visual icon which could be used in the awards titles as well as projected on the walls of the reception area.",
            "section3__button1" : "See all the award titles",
            "section3__button1_link" : "https://vimeo.com/341269393/38e3717cc6",
            "section4__embed1" : "https://player.vimeo.com/video/350860713?loop=1",
            "section4__caption1" : "As the attendees were arriving, the nominees were projected on the sides of the crystal. A countdown informed the attendees when to take their seats as the show was about to begin.",
            "section4__embed2" : "https://player.vimeo.com/video/350600804?loop=1",
            "section4__caption2" : "As the live band began playing, the award's logo was projected above and moved along to the beat.",
            "section4__embed3" : "https://player.vimeo.com/video/350862568?loop=1",
            "section4__caption3" : "After the awards ceremony, the ROM transformed into party mode. The award winners were projected onto the walls and the lighting changed to match the celebratory vibe.",
            "section4__heading1": "03 – Prehistoric and tech giants",
            "section4__paragraph1": "The initial scope of the project was to create a fully animated awards package that included title sequences for each award, the looping videos for the winners and general videos for transitional moments in the show. Working closely with the ROM's AV team, we were able to choreograph the lighting and projected contextural graphics to sync with the phases of the awards show.",
            "section4__paragraph2": "Matching the massive dinosaur skeletons in size, the graphics represented an intriguing contrast between the prehistoric and the new technological future. Overall, the environmental graphics added compelling ways to engage the attendees, spark conversation and complement the energy of the room.",
            "section5__pullquote1": "Below is a prototype of the 3D projection that reacted to the music from the live band. Snap your fingers and drag the background to test it out!",
            "section5__name1": "↓",
            "section6__embed1": "https://whatthechris.github.io",
            "section6__caption1": "The prototype uses the p5 sound library to access the computer's microphone. You may need to refresh the page and enable your computer's microphone to see the effect",
            "section7__heading1": "04 – The party’s over but there's more to celebrate",
            "section7__paragraph1": "It was an honour to have brushed shoulders with Canada's top tech leaders and to have been able to recognize their contributions to Canada’s tech community. Putting together the visuals for one of the biggest Canadian tech events of the year was a big challenge but our hard work paid off as the new revamped Canadian Innovation Awards drew in generous sponsorships and sold out all entry tickets."
        }
    ],
    "wayfindercontent": [
        {
            "hero__eyebrow": "Helping people save for their future",
            "hero__title": "Wayfinder Web App",
            "hero__role1": "UX/ UI Design",
            "hero__role2": "Interaction Design",
            "hero__client": "Great West Life",
            "hero__thumbnail": "wayfinder_thumb.png",
            "hero__image": "wayfinder/wayfinder_photo1.png",
            "highlights__icon1": "comment-text.svg",
            "highlights__heading1": "Providing financial advice for all",
            "highlights__paragraph1": "Great West Life (GWL) believes that their plan members should have the ability to accurately plan for their future no matter their net worth, financial literacy or whether they have time to actively monitor their growth. They saw this as an opportunity that would be beneficial to both their plan members and their sponsor companies.",
            "highlights__icon2": "thumbs-up.svg",
            "highlights__heading2": "The power of user-driven design",
            "highlights__paragraph2": "Extensive user research and testing informed the design of the Wayfinder platform. In turn, users are eased through their financial planning for the future allowing them to set concrete and achievable goals. The web app then provides a personalized and market-aware plan for meeting those goals. ",
            "highlights__icon3": "shield-ok.svg",
            "highlights__heading3": "Peace of mind and reassurance",
            "highlights__paragraph3": "Wayfinder empowers users to see their future finances more clearly through informative and transparent graphs, easy to understand language and actionable context-aware recommendations, such as reminders to maximize their RESP matching benefits. If they are ever uncertain or confused, a financial advisor is just one click away.",
            "section1__heading1": "01 - That's a future me problem",
            "section1__paragraph1": "Great West Life is one of Canada’s largest group retirement and benefit providers allowing millions of Canadians to use their employer’s benefits package. However, they noticed that many of their plan members weren’t taking advantage of their company’s RRSP contribution matching program, thereby leaving “free money” on the table. Upon future investigation this seemed to stem from a larger problem which was that many plan members either weren’t saving for their retirement or didn’t have access to good financial advice to help with their retirement planning.",
            "section1__image1": "wayfinder/wayfinder_photo3.jpg",
            "section1__image1alt": "A man and a woman sitting at a table while conducting an interview",
            "section1__caption1": "Initial research was conducted to determine the desirability, feasibility and viability of the proposed solution.",
            "section2__heading1": "02 - Let's talk money",
            "section2__paragraph1": "Working collaboratively with Deloitte’s Doblin team, we gathered user research in two waves of plan member and sponsor interviews. In these interviews, we asked questions about how Canadians view their finances as well as their retirement and how they seek financial advice. We found that some were getting generic advice from their bank while others were even turned down by financial advisors because they didn’t have enough savings to be considered a worthwhile client. Alternatively, some took matters into their own hands by creating their own spreadsheets but many felt like they didn’t have time to educate themselves, do research, create a plan or shop around and compare advisors. The process of planning for their retirement seemed very arduous so it was clear that we could design a better solution.",
            "section2__image1": "wayfinder/wayfinder_photo4.jpg",
            "section2__image1alt": "A variety of people planning their finances",
            "section3__image1" : "wayfinder/wayfinder_photo5.png",
            "section3__image1alt": "A user journey map showing the various stages of the proposed solution",
            "section3__caption1" : "A user journey for the proposed solution was created to demonstrate how users would be engaged in and outside of the platform. As part of the ideation phase, our user research findings and quotes were paired to proposed product features.",
            "section4__pullquote1" : "Seeing things visually over time and having a comprehensive snapshot of the impact of my decisions today and what it means in the future is helpful to see",
            "section4__name1" : "Danielle (H.E.N.R.Y)",
            "section5__heading1" : "03 - Like a crystal ball for your finances",
            "section5__paragraph1" : "From our research findings, we created three user personas Normal users, Pre-Retirees and H.E.N.R.Y.s (High Earners, Not Rich Yet). After many iterations of user journey maps, user stories, information architecture, wireframing, hi-fidelity designs, user testing and collaboration with our devs to work within technological constraints, Wayfinder was born!",
            "section5__image1" : "wayfinder/wayfinder_photo6.png",
            "section5__image1alt" : "Pie chart showing a potential asset distribution for a retirement portfolio",
            "section5__caption1" : "First, users are taken through a natural language onboarding process where they fill out their account information, set a retirement goal and complete an Investment Personality Questionnaire (IPQ) to determine their investment risk appetite.",
            "section5__image2" : "wayfinder/wayfinder_photo7.png",
            "section5__image2alt" : "The Wayfinder dashboard",
            "section5__caption2" : "The Wealth Curve on the dashboard tracks the user’s retirement goal, along with other life goals and takes into account a variety of circumstantial changes in the market including shortfalls and surpluses.  The recommendations cards prompt users to maximize their employer’s RESP matching benefit and provide other self-directed advice.",
            "section5__image3" : "wayfinder/wayfinder_photo8.png",
            "section5__image3alt" : "The Talk to Coach and Book an Appointment functionality",
            "section5__caption3" : "If a user is ever uncertain, confused or unsure, a financial advisor is accessible via a floating action button. Once given permission from the user, the advisor can see the user’s screen in real time thereby reducing miscommunication.",
            "section6__heading1": "04 - Retirement ready",
            "section6__paragraph1": "Throughout the testing of the final designs, the users clearly felt empowered and more confident about planning their retirement. GWL's business also benefits by positioning itself as the financial provider for wealth products and eventually protection, retirement income and cash flow products as well. This was mainly due to our successful integration of low-touch self-directed and high-touch advisor guidance into one cohesive experience. Finally, all our efforts paid off as Wayfinder was well received by both GWL stakeholders and members at launch. The Wayfinder functionality has since been absorbed by the main GWL app."
        }
    ],
    "motionclients": [
        {
            "motion__id": "spark",
            "motion__heading": "CST Spark – Learning Series",
            "motion__subheading": "Teaching Canadians the basics of RESPs",
            "motion__embed1": "https://player.vimeo.com/video/386331414",
            "motion__caption": "Working with producers in Toronto and another designer in New York, I was in charge of art direction, illustration, animation, editing and sound design. Additionally, I helped with script writing and defining the brand's voice.",
            "motion__paragraph1": "CST Spark came to my team looking to create a video series that would teach Canadians about saving for their child’s post-secondary education and more importantly why they should trust CST Spark with their child’s future. As the first in the series, they needed a video that was informative but also warm and playful in a way that felt like their brand. After many requirements gathering and brand positioning meetings with their marketing team, we crafted a script using characters and a common scenario their target audience could relate to. ",
            "motion__paragraph2": "Always referring back to the goals and tone of voice of the video, I paid special attention to how the audience would perceive the imagery and carefully considered how we were using characters. Audio plays a big role in any video project but to achieve the level of warmth that the client was going for, a larger emphasis was placed on sound design and voice actor selection. In the end everything came together harmoniously to created a video that really pulls at the audience’s heart strings.",
            "motion__button1": "CST Spark Learning Centre",
            "motion__button1_link": "https://www.cstspark.ca/en/learning-centre/learning-series-video-1"
        },
        {
            "motion__id": "eq",
            "motion__heading": "EQ Bank - Brand Video",
            "motion__subheading": "Introducing EQ Bank to the world",
            "motion__embed1": "https://player.vimeo.com/video/212916088",
            "motion__caption": "For this project, I was responsible for art direction, illustration and animation. I worked with a team of designers in Costa Rica to execute this project",
            "motion__paragraph1": "EQ Bank is a purely digital bank meaning they don't have any traditional brick-and-mortar store-fronts. This also means that they need to create a strong online presence in order to explain who they are and the benefits of their service. Along with creating the initial designs of their mobile banking app that launched their business, I led the design and animation of their brand video.",
            "motion__paragraph2": "Working closely with the client and a producer while leading a team of designers in Costa Rica, I carried the project through initial concept, script writing, storyboarding, style frames and final animation delivery. While sticking closely to the financial benefits of banking with EQ, the video presents the information in a fun and inviting way that stays true to the brand identity."
        },
        {
            "motion__id": "brainstation",
            "motion__heading": "BrainStation Online – Video Graphics",
            "motion__subheading": "Designing educational graphics that wow, aid in comprehension and scale up",
            "motion__embed1": "https://player.vimeo.com/video/393313111",
            "motion__embed2": "https://player.vimeo.com/video/393313013",
            "motion__sidebyside": false,
            "motion__caption": "Above is a montage of a few animated scenes that the team created. Below that is a behind the scenes look at the filming of the live action sections. I created the logo animation and provided direction for the sonic branding",
            "motion__paragraph1": "BrainStation is one of Canada’s leading educators of digital skills, offering in-person classes and online live classes. As a way to fill another untapped space, they sought out to create a self-directed learning platform for students to take courses at their own pace and on their own time. BrainStation Online was created to fill this need and the platform needed video content. Every week we learned new concepts ranging from very technical (ie. machine learning and data analytics) to more abstract (ie. user experience design and digital marketing). We then taught the concepts through motion graphics and edited them into a mix of stock video and live action footage to aid in student comprehension and recall.",
            "motion__paragraph2": "Leading a team of four motion designers, I created a set of extensive motion guidelines and a visual language that could be used to produce a variety of visuals while maintaining an acceptable level of consistency.Over many months, I collaborated with the team to solidify a process that included whiteboarding, presenting and defending ideas, peer reviewing and conducting retrospectives in a way that produced high quality videos and made every team member take ownership over their work. By the time that I left the project, we had produced over 15 courses, 540 hours of video and 360 animated scenes. Now thousands of people around the world are learning digital skills online through the videos that my team created.",
            "motion__button1": "BrainStation Online",
            "motion__button1_link": "https://brainstation.io/business/online"
        },
        {
            "motion__id": "loyalty",
            "motion__heading": "Loyalty One – Website Hero Video",
            "motion__subheading": "",
            "motion__embed1": "https://player.vimeo.com/video/393313368",
            "motion__caption": "",
            "motion__paragraph2": "",
            "motion__button1": "LoyaltyOne Website",
            "motion__button1_link": "https://www.loyalty.com/"
        } 
    ],
    "motionfun": [
        {
            "motion__id": "wise",
            "motion__heading": "The Red Oneroi/ Derek Wise Album Art",
            "motion__subheading": "Generating hype for one of Toronto’s biggest hip hop artists",
            "motion__embed1": "https://player.vimeo.com/video/164171274?loop=1",
            "motion__embed2": "https://player.vimeo.com/video/201760018?loop=1",
            "motion__sidebyside": true,
            "motion__caption": "The photo parallax effect is produced by breaking apart a flat image, filling in the missing background and adding camera depth by rearranging the pieces on the z-axis.",
            "motion__paragraph1": "The photo parallax effect had always fascinated me but I'd never been able to find an appropriate client project to use it. I’ve always admired the photography of a friend of mine who goes by the alias Septemberbred so one day I proposed that we collaborate. Using his dark and moody portrait photography shot in Toronto’s Chinatown, I added the effect and timed it to an original music track produced by one of his friends.",
            "motion__paragraph2": "At the time, Derek Wise was making a name for himself in the Canadian trap and hiphop scene and had just signed under the Weekend’s XO label. Septemberbred liked the photo parallax effect so much that when he created the art for Derek Wise’s debut album, I was commissioned to animate it for social media. The looping animated piece created excitement for the album release and it was projected at the official listening party."
        },
        {
            "motion__id": "stormtrooper",
            "motion__heading": "Stormtrooper Helmet 3D Model",
            "motion__subheading": "The time I got really excited for the new Star Wars movie",
            "motion__embed1": "https://sketchfab.com/models/cf6ff6583b044bec9db24f9b7a7ce27f/embed",
            "motion__caption": "Try exploring the 3D model by dragging and zooming. If you have a headset, you can also view it in VR.",
            "motion__paragraph1": "In anticipation for The Force Awakens, I decided to model the new stormtrooper helmet design in Cinema 4D. The semi-rounded yet angular shapes of the helmet were a challenge but the modelling process was surprisingly therapeutic. It is incomplete in it's current state but I expect to finish it one day."
        }
    ]
}